Revit 2027 API
BuiltInFailures.PerformanceFailures.HostHasTooManyInserts Property
 Host object contains too many cutting inserts - it may take long time to update. Consider splitting host object into smaller pieces or using stacked walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostHasTooManyInserts { get; }
Public Shared ReadOnly Property HostHasTooManyInserts As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostHasTooManyInserts {
	FailureDefinitionId^ get ();
}
static member HostHasTooManyInserts : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace